<?php
/*********************/
/*                   */
/*  Version : 5.1.0  */
/*  Author  : RM     */
/*  Comment : 071223 */
/*                   */
/*********************/

$nav = array( 5 => "娱乐", 6 => "服务", 7 => "电脑", 12 => "站长", 8 => "地方", 9 => "其他" );
$nav_keywords = array(
		5 => array( 0 => "音乐", 1 => "视频", 2 => "游戏", 3 => "电影", 4 => "新闻", 5 => "小说", 6 => "军事", 7 => "图片", 8 => "动漫", 9 => "交友", 10 => "明星", 11 => "社区", 12 => "搞笑" ),
		6 => array( 0 => "天气", 1 => "彩票", 2 => "查询", 3 => "手机", 4 => "股票", 5 => "基金", 6 => "银行", 7 => "移动", 8 => "房产", 9 => "菜谱", 10 => "汽车", 11 => "地图", 12 => "健康", 13 => "两性", 14 => "女性", 15 => "时尚" ),
		7 => array( 0 => "软件", 1 => "邮箱", 2 => "博客", 3 => "杀毒", 4 => "闪游", 5 => "硬件", 6 => "桌面", 7 => "聊天", 8 => "BT" ),
		12 => array( 0 => "站长站", 1 => "站长论坛", 2 => "站长工具", 3 => "站长交易", 4 => "站长名录", 5 => "站长帮手", 6 => "站长下载", 7 => "站长资源", 8 => "站长统计", 9 => "站长联盟", 10 => "站长赚钱" ),
		8 => array( 0 => "北京", 1 => "上海", 2 => "广东", 3 => "湖北", 4 => "山东", 5 => "广西", 6 => "湖南", 7 => "四川", 8 => "江苏", 9 => "河南", 10 => "河北", 11 => "山西", 12 => "浙江", 13 => "辽宁", 14 => "安徽", 15 => "福建" ),
		9 => array( 0 => "摄影", 1 => "英语", 2 => "考试", 3 => "教学", 4 => "曲艺", 5 => "琴棋", 6 => "行业", 7 => "国外", 8 => "法律", 9 => "政府", 10 => "公益", 11 => "" )
);
$hot_keywords = array( 0 => "空间" );
?>
