<?php 
$nav_cate_menu_array=array (
  376 => 
  array (
    382 => '文档下载',
    381 => '源码下载',
    380 => '小说下载',
    379 => '图片下载',
    378 => '游戏下载',
    377 => '软件下载',
  ),
  375 => 
  array (
    389 => '桌面游戏',
    388 => '益智游戏',
    387 => '小游戏',
    386 => '体育运动',
    385 => '网络游戏',
    384 => 'PC游戏',
    383 => '单机游戏',
  ),
  374 => 
  array (
    397 => '综艺节目',
    396 => '笑话片',
    395 => '外国片',
    394 => '港台片',
    393 => '警匪片',
    392 => '悬疑片',
    391 => '伦理片',
    390 => '动作片',
  ),
  373 => 
  array (
    399 => '中国民歌',
    398 => '流行歌曲',
    404 => '影视歌曲',
    403 => '革命歌曲',
    402 => '经典老歌',
    401 => '轻音乐',
    400 => '校园歌曲',
  ),
  372 => 
  array (
    413 => '美食烹饪',
    412 => '医学资料',
    411 => '农业生产',
    410 => '电脑网络',
    409 => '技术文献',
    408 => '社会生活',
    407 => '校园生活',
    406 => '色情小说',
    405 => '武侠小说',
  ),
  371 => 
  array (
    421 => '花鸟虫鱼',
    420 => '明星图片',
    419 => '影视图片',
    418 => '旅游风景',
    417 => '手机图片',
    416 => '汽车图片',
    415 => '美女图片',
    414 => '电脑桌面',
  ),
  370 => 
  array (
    428 => '网络软件',
    427 => '3D动画',
    426 => '制图软件',
    425 => '播放软件',
    424 => '财会软件',
    423 => '银行软件',
    422 => '电脑软件',
  ),
  429 => 
  array (
    430 => '品牌',
  ),
);
 ?>